src/Documents/ПлатежноеПоручениеВходящее/ПлатежноеПоручениеВходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПлатежноеПоручениеВходящее</name>
  <basedOn>Document.ГТД</basedOn>
  <basedOn>Document.СчетНаОплату</basedOn>
  <registerRecords>AccumulationRegister.ДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияДенежныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОперации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКвитанции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПоступлениеУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьяДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНаОплату</name>
    <type>
      <types>DocumentRef.СчетНаОплату</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Транспорт</name>
    <attributes>
      <name>Транспорт</name>
      <type>
        <types>DefinedType.Транспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоллар</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/СчетНаОплату/СчетНаОплату.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетНаОплату</name>
  <basedOn>Document.ГТД</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ГТД</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Оплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДоллар</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/ПлатежноеПоручениеВходящее/ObjectModule.bsl
Процедура ПередЗаписью ( Отказ, РежимЗаписи, РежимПроведения )
	
	Если ( ОбменДанными.Загрузка ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьДополнительныеСвойства ()
	
	ДополнительныеСвойства.Вставить ( "Перепроведение", Проведен );
	ДополнительныеСвойства.Вставить ( "ОперативноеПроведение", ( ЭтоНовый () И НачалоДня ( Дата ) = НачалоДня ( ТекущаяДата () ) ) ); 
	
КонецПроцедуры 

Процедура ОбработкаПроведения ( Отказ, РежимПроведения )
	
	заполнитьДополнительныеСвойства	();
	данные = Новый Структура;
	данные.Вставить ( "Ссылка", Ссылка );
	данные.Вставить ( "Дата", Дата );
	данные.Вставить ( "Движения", Движения );
	данные.Вставить ( "МоментВремени", МоментВремени () );
	данные.Вставить ( "ДополнительныеСвойства", ДополнительныеСвойства );
	Отказ = НЕ Документы.ПлатежноеПоручениеВходящее.Проведение ( данные );
	
КонецПроцедуры

Процедура ОбработкаЗаполнения ( ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка )
	
	Если ТипЗнч ( ДанныеЗаполнения ) = Тип ( "ДокументСсылка.СчетНаОплату" ) Тогда
		заполнитьПоГТД ( ДанныеЗаполнения );
	КонецЕсли;
	
КонецПроцедуры

Процедура заполнитьПоГТД ( Данные )
	
	// шапка
	ГТД = Данные;
	с = "
	|выбрать
	|	Контрагент как Контрагент, Сумма как Сумма,
	| 	Организация как Организация, СуммаДоллар как СуммаДоллар,
	|	Ссылка как СчетНаОплату, НазначениеПлатежа как НазначениеПлатежа,
	|	представление ( Ссылка ) как ПредставлениеСчетНаОплату,
	|	ГТД как ГТД 
	|из
	|	Документ.СчетНаОплату
	|где
	|	Ссылка = &Данные  
	|";
	запрос = Новый Запрос ( с );
	запрос.УстановитьПараметр ( "Данные", Данные );
	результат = запрос.Выполнить ();
	выборка = результат.Выбрать ();
	выборка.Следующий ();
	Организация = выборка.Организация;
	Контрагент = выборка.Контрагент;
	Сумма = выборка.Сумма;
	СуммаДоллар = выборка.СуммаДоллар;
	СчетНаОплату = выборка.СчетНаОплату;
	ГТД = выборка.ГТД;
	НазначениеПлатежа = выборка.НазначениеПлатежа;
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Комментарий = "На основании счета на оплату - " + выборка.ПредставлениеСчетНаОплату;
	
КонецПроцедуры
